[{"pk": 1, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "About OpenAerialMap", "url": "\/about\/", "template_name": "", "sites": [1], "content": "<p>\r\nThis project is an attempt to gather data from various free and open aerial imagery datasources around the world, and use them to create a single, coherent open world view.\r\n<\/p> \r\n<p>\r\nIf you are interested in seeing your data here, please email <a href=\"mailto:crschmidt@crschmidt.net\">crschmidt@crschmidt.net<\/a>.<\/p>\r\n<p>Code is available from <a href=\"http:\/\/svn.openaerialmap.hypercube.telascience.org\">SVN<\/a>.<\/p>", "enable_comments": false}}, {"pk": 3, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Licensing of OAM Data", "url": "\/licensing\/", "template_name": "", "sites": [1], "content": "<p>\r\nOpenAerialMap is a young project, and as such, many of the licensing restrictions are still being worked out. In the short term, <b>all imagery uploaded to OpenAerialMap should be compatible with one of the following two licenses<\/b>: \r\n<\/p>\r\n<ul>\r\n <li><a href=\"http:\/\/creativecommons.org\/licenses\/by\/3.0\/\">Creative Commons Attribution License<\/a><\/li>\r\n <li><a href=\"http:\/\/creativecommons.org\/licenses\/publicdomain\/\">Public Domain<\/a> (or the <a href=\"http:\/\/sam.zoy.org\/wtfpl\/\">WTF PL<\/a>), if you prefer.<\/li>\r\n<\/ul>\r\n<p>\r\nAll information in OpenAerialMap is believed to be compatible with one of the above licenses, and the license it is compatible with is described on the datasource page for the dataset. Note that these licenses are essentially used as categories at this time: The specific license the data is released under may not be, for example, Creative Comons Attribution, but simply a statement that says \"Any use of the data requires attribution of the source.\", which is compatible with the CC license. If you believe that some dataset is available via OAM in error, please join the <a href=\"http:\/\/openaerialmap.org\/mailman\/listinfo\/talk_openaerialmap.org\">OpenAerialMap mailing list<\/a> and let us know, and we will do our best to resolve the issue. \r\n<\/p>\r\n\r\n<p>\r\nIf you are not the copyright holder, and can not find a statement of copyright about the data, please do <b>not<\/b> upload it to OpenAerialMap at this time. We are currently working on making the service work. As time goes on, we will expand this licensing. By uploading imagery, you are stating that you are able to act on the behalf of the copyright holder and have released the  data under one of the above licenses, or the data has been publically published under one of the above licenses.\r\n<\/p>\r\n", "enable_comments": false}}, {"pk": 2, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Tutorial", "url": "\/tutorial\/", "template_name": "", "sites": [1], "content": "<p>\r\nThe first step to uploading imagery to OpenAerialMap is to create an 'Agent' to represent the agency or person who the imagery was taken by. Some agents already exist: you can see the existing agents in the 'Agent' dropdown on the <a href=\"http:\/\/openaerialmap.hypercube.telascience.org\/datasource\/create\/\">Create DataSource<\/a> page.\r\n<\/p>\r\n<p>\r\nIf yours does not exist, you can create one by visiting the <a href=\"\/agent\/create\/\">Create Agent<\/a> page.\r\n<\/p>\r\n<p>\r\n Next, you must <a href=\"\/datasource\/create\/\">create a datasource<\/a>. A datasource is the 'container' for multiple datarecords: it is a record describing information like date, agent, attribution, description, etc.\r\n<\/p> \r\n<p>\r\n  Once you have created a datasource, you must upload data. Data uploaded should be enough information that 'gdalinfo' on a file will return useful information. If this is a jpeg with a world file, for example, both the .jpg and world file for it should be uploaded. There is an 'upload file' form at the bottom of every datasource.\r\n<\/p>\r\n<p> \r\n  When you upload a file, it should give a message that gives a path to the file. Once you have this, you can copy this path, and use it in the next step, to create a data record.\r\n<\/p>   \r\n<p>\r\n  <a href=\"\/datarecord\/create\/\">Creating a datarecord<\/a> is reasonably self explanatory. \r\n<\/p>  <ul>\r\n   <li>The DataSource should be the datasource your data is attached to.<\/li>\r\n   <li>Extent should be a comma seperated list of left,bottom,right,top.<\/li>\r\n   <li>Layername should be null.<\/li>\r\n \r\n   <li>Data resolution is base data resolution in meters\/pixel.<\/li>\r\n\r\n   <li>min scale is the 'largest' scale that the map is displayed at: this \r\n   will likely be something like '100' or '1000'.<\/li>\r\n\r\n   <li>max scale is the 'smallest' scale that the map is displayed at -- \r\n   this should be something like 25000 or 50000.<\/li>\r\n\r\n   <li>The location of the data will be: \/optistor\/viz\/openaerialmap\/datasources\/$YourId\/yourfile.png<\/li>\r\n<\/ul>", "enable_comments": true}}, {"pk": 4, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Using OpenAerialMap in Other Tools", "url": "\/usage\/", "template_name": "", "sites": [1], "content": "<p>OpenAerialMap is designed to be widely used: it is possible to use it in a number of tools.<\/p>\r\n\r\n<ul>\r\n\r\n<li>You can load OpenAerialMap data into WorldWind and other tools that support WorldWind web requests. Simply load the <a href=\"\/static\/ww.xml\">WorldWind XML Metadata<\/a> into WorldWind-supporting applications.<\/li>\r\n<li>You can load OpenAerialMap data into JOSM, the OpenStreetMap editing client: See <a href=\"http:\/\/wiki.openaerialmap.org\/Using_With_OSM\">Using With OpenStreetMap<\/a>.<\/li>\r\n<li>You can load OpenAerialMap into a Google Maps Custom Tile Overlay: see <a href=\"http:\/\/wiki.openaerialmap.org\/Using_With_Google_Maps\">Using With Google Map<\/a>.<\/li>\r\n<li>You can load OpenAerialMap into the Mobile GMaps application: see <a href=\"http:\/\/wiki.openaerialmap.org\/Using_With_MGMaps\">Using With MGMaps<\/a> for more.<\/li>\r\n<li>You can load OpenAerialMap into MapServer: see <a href=\"http:\/\/wiki.openaerialmap.org\/Using_With_MapServer\">Using With MapServer<\/a> for more.<\/li>\r\n<li>You can load OpenAerialMap into any WMS client: see <a href=\"http:\/\/wiki.openaerialmap.org\/Using_With_WMS\">Using With WMS<\/a> for more.\r\n<\/ul>", "enable_comments": false}}]
